# K-Pop Exploratory Data Analysis

## Author: https://github.com/ssim3

4 csv files and what their columns mean: <br><br>


- kpop_music_videos.csv:

    - Date - Release date of the Music Video <br>
    - Artist - The Artist <br>
    - Song Name - Title of the Music Video <br>
    - Korean Name - Korean Title of the MV <br>
    - Director - Director of the music video <br>
    - Video - URL to the MV <br>
    - Type - Genre of the Music Video <br>
    - Release - Major / Minor / Japanese Release <br>

<br>

- kpop_idols_girl_groups.csv:

    - Name - Name of the girl group <br>
    - Short - Short Name of the girl group <br>
    - Korean Name - Korean Name of the girl group <br>
    - Debut - When the girl group Debuted <br>
    - Company - Company the girl group is under <br>
    - Members - No. of members in the GG <br>
    - Fanclub Name - Fanclub Name of the GG <br>
    - Active - Is the GG active? <br>

<br>

- kpop_idols_boy_groups.csv:
    - Name - Name of the boy group <br>
    - Short - Short Name of the boy group <br>
    - Korean Name - Korean Name of the boy group <br>
    - Debut - When the boy group Debuted <br>
    - Company - Company the boy group is under <br>
    - Members - No. of members in the BG <br>
    - Fanclub Name - Fanclub Name of the BG <br>
    - Active - Is the BG active? <br>
    
<br>

- kpop_idols.csv
    - Stage Name - Idol's stage name
    - Full Name - Idol's Full Name
    - Korean Name - Idol's Korean Name
    - K. Stage Name - Idol's Korean Stage Name
    - Date of Birth - Idol's DoB
    - Group - Group the Idol is from
    - Country - Where the idol operates
    - Birthplace - Idol's Origin Country
    - Other Group - Other groups the Idol belongs to
    - Gender - Idol's Gender

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Importing datasets

In [3]:
mv = pd.read_csv("kpop_music_videos.csv")
gg = pd.read_csv("kpop_idols_girl_groups.csv")
bg = pd.read_csv("kpop_idols_boy_groups.csv")
idols = pd.read_csv("kpop_idols.csv")

In [4]:
# Music Videos
mv.head()

,Date,Artist,Song Name,Korean Name,Director,Video,Type,Release
0,2020-05-22,Agust D,Daechwita,대취타,NaN,https://youtu.be/qGjAWJ2zWWI,Boy Solo,Major
1,2020-05-21,Yubin,yaya (Me Time),넵넵,NaN,https://youtu.be/BJD0arHF_5c,Girl Solo,Major
2,2020-05-21,OnlyOneOf,Angel (prod. GRAY),NaN,NaN,https://youtu.be/vVTo8p72FxQ,Boy,Major
3,2020-05-20,Ryu Sujeong,Tiger Eyes,NaN,NaN,https://youtu.be/aE6curPGQRY,Girl Solo,Major
4,2020-05-20,Crush,Mayday feat. Joy (Red Velvet),자나깨나,NaN,https://youtu.be/29ycT6fA-Rs,Boy Solo,Major

In [5]:
# Girl Groups
gg.head()

,Name,Short,Korean Name,Debut,Company,Members,Orig. Memb.,Fanclub Name,Active
0,(G)I-DLE,NaN,(여자)아이들,2018-05-02,Cube,6,6,NaN,Yes
1,15&,NaN,피프틴앤드,2012-10-05,JYP,2,2,NaN,No
2,2EYES,NaN,투아이즈,2013-07-20,SidusHQ,4,5,NaN,No
3,2NE1,NaN,투애니원,2009-05-06,YG,4,4,Blackjack,No
4,3YE,NaN,써드아이,2019-05-21,GH,3,3,NaN,Yes

In [6]:
# Boy Groups
bg.head()

,Name,Short,Korean Name,Debut,Company,Members,Orig. Memb.,Fanclub Name,Active
0,100%,NaN,백퍼센트,2012-09-18,TOP Media,4,7,Perfection,Yes
1,14U,NaN,원포유,2017-04-17,BG,14,14,NaN,Yes
2,1the9,NaN,원더나인,2019-02-09,MBK,9,9,NaN,Yes
3,24K,NaN,투포케이,2012-09-06,Choeun,8,6,24U,Yes
4,2AM,NaN,투에이엠,2008-06-21,"JYP, Big Hit",4,4,I Am,No

In [7]:
# idols
idols.head()

,Stage Name,Full Name,Korean Name,K. Stage Name,Date of Birth,Group,Country,Birthplace,Other Group,Gender
0,A.M,Seong Hyunwoo,성현우,에이엠,1996-12-31,Limitless,South Korea,NaN,NaN,M
1,Ace,Jang Wooyoung,장우영,에이스,1992-08-28,VAV,South Korea,NaN,NaN,M
2,Aeji,Kwon Aeji,권애지,애지,1999-10-25,Hashtag,South Korea,Daegu,NaN,F
3,AhIn,Lee Ahin,이아인,아인,1999-09-27,MOMOLAND,South Korea,Wonju,NaN,F
4,Ahra,Go Ahra,고아라,아라,2001-02-21,Favorite,South Korea,Yeosu,NaN,F

In [8]:
# mv information

mv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3772 entries, 0 to 3771
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         3772 non-null   object
 1   Artist       3772 non-null   object
 2   Song Name    3771 non-null   object
 3   Korean Name  2786 non-null   object
 4   Director     627 non-null    object
 5   Video        3772 non-null   object
 6   Type         3772 non-null   object
 7   Release      3759 non-null   object
dtypes: object(8)
memory usage: 235.9+ KB

In [9]:
# gg information

gg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 152 entries, 0 to 151
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          152 non-null    object
 1   Short         21 non-null     object
 2   Korean Name   152 non-null    object
 3   Debut         152 non-null    object
 4   Company       152 non-null    object
 5   Members       152 non-null    int64
 6   Orig. Memb.   152 non-null    int64
 7   Fanclub Name  46 non-null     object
 8   Active        152 non-null    object
dtypes: int64(2), object(7)
memory usage: 10.8+ KB

In [10]:
#  bg information

bg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 147 entries, 0 to 146
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          147 non-null    object
 1   Short         18 non-null     object
 2   Korean Name   147 non-null    object
 3   Debut         147 non-null    object
 4   Company       146 non-null    object
 5   Members       147 non-null    int64
 6   Orig. Memb.   147 non-null    int64
 7   Fanclub Name  61 non-null     object
 8   Active        147 non-null    object
dtypes: int64(2), object(7)
memory usage: 10.5+ KB

In [11]:
# idols information

idols.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1310 entries, 0 to 1309
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Stage Name     1310 non-null   object
 1   Full Name      1304 non-null   object
 2   Korean Name    1304 non-null   object
 3   K. Stage Name  1309 non-null   object
 4   Date of Birth  1310 non-null   object
 5   Group          1219 non-null   object
 6   Country        1310 non-null   object
 7   Birthplace     689 non-null    object
 8   Other Group    122 non-null    object
 9   Gender         1310 non-null   object
dtypes: object(10)
memory usage: 102.5+ KB

## Cleaning up the MV dataset

1. Dropping columns

In [12]:
mv.drop(["Korean Name", "Video", "Director"], axis=1, inplace=True)

mv.head()

         Date       Artist                      Song Name       Type Release
0  2020-05-22      Agust D                      Daechwita   Boy Solo   Major
1  2020-05-21        Yubin                 yaya (Me Time)  Girl Solo   Major
2  2020-05-21    OnlyOneOf             Angel (prod. GRAY)        Boy   Major
3  2020-05-20  Ryu Sujeong                     Tiger Eyes  Girl Solo   Major
4  2020-05-20        Crush  Mayday feat. Joy (Red Velvet)   Boy Solo   Major

2. Change "Date" column dtype

In [13]:
mv["Date"] = pd.to_datetime(mv["Date"])
mv.Date.dtype

dtype('<M8[ns]')

3. Song with NaN title will be dropped

In [14]:
mv.loc[mv["Song Name"].isna()]
mv.drop(901, inplace=True)
mv.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3771 entries, 0 to 3771
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       3771 non-null   datetime64[ns]
 1   Artist     3771 non-null   object
 2   Song Name  3771 non-null   object
 3   Type       3771 non-null   object
 4   Release    3758 non-null   object
dtypes: datetime64[ns](1), object(4)
memory usage: 176.8+ KB

4. MV's with NaN Releases will be dropped as well

In [15]:
rows_to_drop = mv.loc[mv["Release"].isna()].index
mv.drop(rows_to_drop, inplace=True)

mv.info() # No missing elements now

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3758 entries, 0 to 3771
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       3758 non-null   datetime64[ns]
 1   Artist     3758 non-null   object
 2   Song Name  3758 non-null   object
 3   Type       3758 non-null   object
 4   Release    3758 non-null   object
dtypes: datetime64[ns](1), object(4)
memory usage: 176.2+ KB

In [16]:
mv.head()

        Date       Artist                      Song Name       Type Release
0 2020-05-22      Agust D                      Daechwita   Boy Solo   Major
1 2020-05-21        Yubin                 yaya (Me Time)  Girl Solo   Major
2 2020-05-21    OnlyOneOf             Angel (prod. GRAY)        Boy   Major
3 2020-05-20  Ryu Sujeong                     Tiger Eyes  Girl Solo   Major
4 2020-05-20        Crush  Mayday feat. Joy (Red Velvet)   Boy Solo   Major

## Cleaning up GG dataframe

1. Dropping unwanted columns

In [17]:
gg.columns
gg.drop(["Short", "Korean Name", "Fanclub Name"], axis=1, inplace=True)

2. Changing Debut column to DateTime

In [18]:
gg.Debut = pd.to_datetime(gg["Debut"])
gg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 152 entries, 0 to 151
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         152 non-null    object
 1   Debut        152 non-null    datetime64[ns]
 2   Company      152 non-null    object
 3   Members      152 non-null    int64
 4   Orig. Memb.  152 non-null    int64
 5   Active       152 non-null    object
dtypes: datetime64[ns](1), int64(2), object(3)
memory usage: 7.2+ KB

In [19]:
gg.head() # All cleaned up

       Name      Debut  Company  Members  Orig. Memb. Active
0  (G)I-DLE 2018-05-02     Cube        6            6    Yes
1       15& 2012-10-05      JYP        2            2     No
2     2EYES 2013-07-20  SidusHQ        4            5     No
3      2NE1 2009-05-06       YG        4            4     No
4       3YE 2019-05-21       GH        3            3    Yes

## Same thing with BG dataframe

1. Dropping unwanted columns

In [20]:
bg.columns
bg.drop(["Short", "Korean Name", "Fanclub Name"], axis=1, inplace=True)

2. Changing Debut column to datetime dtype

In [21]:
bg.Debut = pd.to_datetime(bg["Debut"])
bg.Debut.dtype

dtype('<M8[ns]')

3. Dropping row with empty Company (row 63)

In [22]:
bg.drop(bg.loc[bg["Company"].isna()].index, inplace=True)

In [23]:
bg.head() # All cleaned up

    Name      Debut       Company  Members  Orig. Memb. Active
0   100% 2012-09-18     TOP Media        4            7    Yes
1    14U 2017-04-17            BG       14           14    Yes
2  1the9 2019-02-09           MBK        9            9    Yes
3    24K 2012-09-06        Choeun        8            6    Yes
4    2AM 2008-06-21  JYP, Big Hit        4            4     No

## Cleaning up Idols DataFrame

1. Dropping unwanted columns

In [24]:
idols.columns
idols.drop(["Full Name", "Korean Name", "K. Stage Name", "Other Group"], axis=1, inplace=True)
idols.head()

  Stage Name Date of Birth      Group      Country Birthplace Gender
0        A.M    1996-12-31  Limitless  South Korea        NaN      M
1        Ace    1992-08-28        VAV  South Korea        NaN      M
2       Aeji    1999-10-25    Hashtag  South Korea      Daegu      F
3       AhIn    1999-09-27   MOMOLAND  South Korea      Wonju      F
4       Ahra    2001-02-21   Favorite  South Korea      Yeosu      F

2. Since I removed the "Full Name" column, I renamed "Stage Name" as just "Name"

In [25]:
idols.rename(columns = {"Stage Name":"Name"}, inplace = True)

3. Filled in N/A rows with some info

In [26]:
idols["Group"] = idols["Group"].fillna("N/A")
idols["Birthplace"] = idols["Birthplace"].fillna("Unknown")

idols.info() # No more missing values

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1310 entries, 0 to 1309
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           1310 non-null   object
 1   Date of Birth  1310 non-null   object
 2   Group          1310 non-null   object
 3   Country        1310 non-null   object
 4   Birthplace     1310 non-null   object
 5   Gender         1310 non-null   object
dtypes: object(6)
memory usage: 61.5+ KB

In [27]:
idols.head() # All cleaned up

   Name Date of Birth      Group      Country Birthplace Gender
0   A.M    1996-12-31  Limitless  South Korea    Unknown      M
1   Ace    1992-08-28        VAV  South Korea    Unknown      M
2  Aeji    1999-10-25    Hashtag  South Korea      Daegu      F
3  AhIn    1999-09-27   MOMOLAND  South Korea      Wonju      F
4  Ahra    2001-02-21   Favorite  South Korea      Yeosu      F

# Merging DataFrames

## Female Idols and their Groups

1. Merging Female Idols from Idols dframe to GG dframe

In [50]:
f_idols_n_groups = idols.merge(gg, how="left", left_on="Group", right_on="Name", suffixes=["_Idol", "_Group"])

In [51]:
# Dropping Male idols
f_idols_n_groups.drop(f_idols_n_groups[f_idols_n_groups["Gender"] == "M"].index, inplace=True)

In [52]:
f_idols_n_groups.head()

,Name_Idol,Date of Birth,Group,Country,Birthplace,Gender,Name_Group,Debut,Company,Members,Orig. Memb.,Active
2,Aeji,1999-10-25,Hashtag,South Korea,Daegu,F,NaN,NaT,NaN,NaN,NaN,NaN
3,AhIn,1999-09-27,MOMOLAND,South Korea,Wonju,F,NaN,NaT,NaN,NaN,NaN,NaN
4,Ahra,2001-02-21,Favorite,South Korea,Yeosu,F,Favorite,2017-07-05,Astory,6.0,6.0,Yes
5,Ahyoung,1991-05-26,Dal Shabet,South Korea,Seoul,F,Dal Shabet,2011-01-03,Happy Face,4.0,6.0,Hiatus
6,Ahyung,1996-08-27,P.O.P,South Korea,Pohang,F,P.O.P,2017-07-26,DWM,6.0,6.0,Yes

In [65]:
f_idols_n_groups.info() # Over 200 missing rows / Soloists in the GG dataframe

<class 'pandas.core.frame.DataFrame'>
Int64Index: 634 entries, 2 to 1309
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name_Idol      634 non-null    object
 1   Date of Birth  634 non-null    object
 2   Group          634 non-null    object
 3   Country        634 non-null    object
 4   Birthplace     634 non-null    object
 5   Gender         634 non-null    object
 6   Name_Group     381 non-null    object
 7   Debut          381 non-null    datetime64[ns]
 8   Company        381 non-null    object
 9   Members        381 non-null    float64
 10  Orig. Memb.    381 non-null    float64
 11  Active         381 non-null    object
dtypes: datetime64[ns](1), float64(2), object(9)
memory usage: 80.6+ KB

## Male Idols and their Groups

2. Merging the remaining idols with Boy Groups Dataframe

In [60]:
m_idols_n_groups = idols.merge(bg, how="left", left_on="Group", right_on="Name", suffixes=["_Idol", "_Group"])

In [61]:
m_idols_n_groups.drop(m_idols_n_groups[m_idols_n_groups["Gender"] == "F"].index, inplace=True)

In [62]:
m_idols_n_groups.head()

,Name_Idol,Date of Birth,Group,Country,Birthplace,Gender,Name_Group,Debut,Company,Members,Orig. Memb.,Active
0,A.M,1996-12-31,Limitless,South Korea,Unknown,M,Limitless,2019-07-09,ONO,4.0,4.0,Yes
1,Ace,1992-08-28,VAV,South Korea,Unknown,M,VAV,2015-10-31,A team,7.0,6.0,Yes
12,Allen,1999-04-26,CRAVITY,USA,Unknown,M,CRAVITY,2020-04-04,Starship,9.0,9.0,Yes
15,Anthony,1998-03-12,VARSITY,China,Unknown,M,NaN,NaT,NaN,NaN,NaN,NaN
22,Aron,1993-05-21,NU'EST,South Korea,California,M,NU'EST,2012-03-15,Pledis,5.0,5.0,Yes

In [64]:
m_idols_n_groups.info() # 200 missing rows / Soloists in the BG dataframe

<class 'pandas.core.frame.DataFrame'>
Int64Index: 676 entries, 0 to 1308
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name_Idol      676 non-null    object
 1   Date of Birth  676 non-null    object
 2   Group          676 non-null    object
 3   Country        676 non-null    object
 4   Birthplace     676 non-null    object
 5   Gender         676 non-null    object
 6   Name_Group     465 non-null    object
 7   Debut          465 non-null    datetime64[ns]
 8   Company        465 non-null    object
 9   Members        465 non-null    float64
 10  Orig. Memb.    465 non-null    float64
 11  Active         465 non-null    object
dtypes: datetime64[ns](1), float64(2), object(9)
memory usage: 68.7+ KB

# Gathering Insights & Visualizations!!!!

## Music Videos:

In [71]:
mv.head()

        Date       Artist                      Song Name       Type Release
0 2020-05-22      Agust D                      Daechwita   Boy Solo   Major
1 2020-05-21        Yubin                 yaya (Me Time)  Girl Solo   Major
2 2020-05-21    OnlyOneOf             Angel (prod. GRAY)        Boy   Major
3 2020-05-20  Ryu Sujeong                     Tiger Eyes  Girl Solo   Major
4 2020-05-20        Crush  Mayday feat. Joy (Red Velvet)   Boy Solo   Major

Date        Song Name
1992-03-23  I Know                           1
            You, In The Fantasy              1
1993-06-06  Anyhow Song                      1
            To You                           1
1994-08-08  Dreaming of Bal-Hae              1
                                            ..
2020-05-20  Mayday feat. Joy (Red Velvet)    1
            Tiger Eyes                       1
2020-05-21  Angel (prod. GRAY)               1
            yaya (Me Time)                   1
2020-05-22  Daechwita                        1
Name: Song Name, Length: 3751, dtype: int64